rfloyd01/PersonalCaddie/Firmware/nRF52840_Drivers/main.c
    if ((float)maximum_samples == (float)(current_sensor_odr * (float)m_connection_interval / 1000.0))
    {
        maximum_samples--;
    }

    if (m_use_composite_data)
    {
        if (maximum_samples > (MAX_SENSOR_SAMPLES / 3))
        {
            bool found = false;
            for (int i = 2; i <= 5; i++)
            {
                if (maximum_samples % i == 0)
                {
                    maximum_samples = maximum_samples / i;
                    found = true;
                    break;
                }
            }

            if (!found) maximum_samples = (MAX_SENSOR_SAMPLES / 3);
        }
    }
    else
    {
        if (maximum_samples > MAX_SENSOR_SAMPLES) maximum_samples = MAX_SENSOR_SAMPLES;
    }

    //If the new maximum value doesn't match the value for m_current_sensor_samples
    //calculated in the calculate_samples_and_connection_interval() method, update
    //that value now.
    if (maximum_samples != m_current_sensor_samples)
    {
        m_current_sensor_samples = maximum_samples;
        SEGGER_RTT_printf(0, "Based on connection interval and ODR, sensor samples have been adjusted to %d.\n", m_current_sensor_samples);
    }
}

void data_read_handler(int measurements_taken)
{
    //Everytime the data reading timer goes off we take sensor readings and then 
    //update the appropriate characteristic values. The timer should go off SENSOR_SAMPLES times
    //every connection interval
    int offset = SAMPLE_SIZE * measurements_taken;

    if (m_use_composite_data)
    {
        //If the m_use_composite_data boolean is true then data from all three sensors is 
        //stored in a single characteristic.
        offset *= 3; //we can only fit 1/3 of the data when sharing a single characteristic
        offset += 5; //the composite data characteristic has the timestamp and number of data points variables at the front of the characteristic
        imu_comm.acc_comm.get_data(composite_characteristic_data, offset);
        imu_comm.gyr_comm.get_data(composite_characteristic_data, offset + SAMPLE_SIZE);
        imu_comm.mag_comm.get_data(composite_characteristic_data, offset + SAMPLE_SIZE + SAMPLE_SIZE);
    }
    else
    {
        //If the m_use_composite_data boolean is false then data from all each sensor is
        //stored into their own characteristics
        imu_comm.acc_comm.get_data(acc_characteristic_data, offset);
        imu_comm.gyr_comm.get_data(gyr_characteristic_data, offset);
        imu_comm.mag_comm.get_data(mag_characteristic_data, offset);
    }
}


//Functions for updating sensor power modes and settings
static void sensor_idle_mode_start()
{ 
    //In this mode, the appropriate TWI bus(es) is active and power is going to the sensors but the 
    //sensors are put into a lower power mode and are not actively taking measurements. A red LED
    //on the board blinks during this mode
    if (current_operating_mode == SENSOR_IDLE_MODE) return; //no need to change anything if already in idle mode

    //swap to the red LED, also make sure that the blue and green LEDs are off
    active_led = RED_LED;
    nrf_gpio_pin_set(GREEN_LED); //LEDs must be set high to turn off
    nrf_gpio_pin_set(BLUE_LED); //LEDs must be set high to turn off

    ret_code_t err_code;

    if (current_operating_mode == SENSOR_ACTIVE_MODE)
    {
        //If we're transitioning from active to idle mode we need to stop the data collection timer
        //and then put the sensor into sleep mode. There's a different procedure for each sensor
        //so a specific method is called
        data_timers_stop();
        
        //Put all sensors into idle mode, any of the sensors that are active
        //will be properly de-initialized
        lsm9ds1_idle_mode_enable(SENSOR_ACTIVE_MODE);
        fxos8700_idle_mode_enable(SENSOR_ACTIVE_MODE);
        fxas21002_idle_mode_enable();
        bmi270_idle_mode_enable(false);
        bmm150_idle_mode_enable(false);

        //the LED is deactivated during data collection so turn it back on
        led_timers_start();
    }
    else 
    {
        //If we're transitioning from connected mode to sensor idle mode then we're going to need 
        //to turn on any necessary TWI busses to allow for communication with the sensors.
        enable_twi_bus(imu_comm.acc_comm.twi_bus->inst_idx);
        enable_twi_bus(imu_comm.gyr_comm.twi_bus->inst_idx);
        enable_twi_bus(imu_comm.mag_comm.twi_bus->inst_idx);
    }

    current_operating_mode = SENSOR_IDLE_MODE; //set the current operating mode to idle
    SEGGER_RTT_WriteString(0, "Sensor Idle Mode engaged.\n");
}

static void sensor_active_mode_start()
{
    //All of the settings for the sensor should have been set already, we just need to activate them
    //and then start the data collection timer. We also disable the LED to save on power
    if (current_operating_mode == SENSOR_ACTIVE_MODE) return; //no need to change anything if already in active mode
    led_timers_stop();

    //Put all initialized sensors into active mode.
    lsm9ds1_active_mode_enable();
    fxos8700_active_mode_enable();
    fxas21002_active_mode_enable(current_operating_mode);
    bmi270_active_mode_enable(current_operating_mode);
    bmm150_active_mode_enable(sensor_odr_calculate(), current_operating_mode);

    //uncomment the below lines to read active sensor registers and confirm settings
    bmm150_get_actual_settings();

    //start data acquisition by turning on the data timers
    data_timers_start();
    
    current_operating_mode = SENSOR_ACTIVE_MODE; //set the current operating mode to active
    m_data_ready = false; //Want to make sure we start with fresh data
    SEGGER_RTT_WriteString(0, "Sensor Active Mode engaged.\n");
}

static void connected_mode_start()
{
    //There are two ways to enter connected mode. We either enter this mode when a connection is
    //first established, or when we navigate to one of the menu screens in the front end. In the 
    //case where the connection is first established, we use this opportunity to initialize any
    //sensors that need an initialization (as of this writing only the BMI/BMM sensors require
    //this). After this initialization is complete, or if connected mode is entered via menu
    //navigation in the front end, we make sure that any active sensors are placed into sleep mode
    //and that any TWI busses are turned off. We also change the on-board blinking LED to green.
    if (current_operating_mode == CONNECTED_MODE) return; //no need to change anything if already in connected mode

    bool bmi270_init = false, bmm150_init = false;
    if (current_operating_mode == ADVERTISING_MODE)
    {
        //all of the connected_mode_enabled() methods require the TWI bus(es) to be
        //on. These buses shouldn't be on when going from advertising mode to 
        //connected mode so turn them on now to avoid any TWI errors being thrown.
        enable_twi_bus(imu_comm.acc_comm.twi_bus->inst_idx);
        enable_twi_bus(imu_comm.gyr_comm.twi_bus->inst_idx);
        enable_twi_bus(imu_comm.mag_comm.twi_bus->inst_idx);

        //If any BMI/BMM sensors are selected they will need to be configured before
        //they can be used. Setting the necessary booleans to true will allow this
        //configuration to occur.
        if (default_sensors[0] == BMI270_ACC || default_sensors[1] == BMI270_GYR) bmi270_init = true; 
        if (default_sensors[2] == BMM150_MAG) bmm150_init = true;
    }

    //Call the connected_mode_enable() method for all sensors. Only sensors that are in active
    //use will actually do anything with these methods
    bmi270_connected_mode_enable(bmi270_init);
    bmm150_connected_mode_enable(bmm150_init);
    fxos8700_connected_mode_enable();
    fxas21002_connected_mode_enable();
    lsm9ds1_connected_mode_enable();

    //Disable all active TWI busses
    disable_twi_bus(imu_comm.acc_comm.twi_bus->inst_idx);
    disable_twi_bus(imu_comm.gyr_comm.twi_bus->inst_idx);
    disable_twi_bus(imu_comm.mag_comm.twi_bus->inst_idx);

    //change the color of the blinking LED to green, also make sure that the red
    //and blue LEDs are off. If we're coming here from sensor active mode then 
    //we're going to need to turn on the LED first and also deactivate the data timer
    if (current_operating_mode == SENSOR_ACTIVE_MODE)
    {
        data_timers_stop();
        led_timers_start();
    }

    active_led = GREEN_LED;
    nrf_gpio_pin_set(RED_LED); //LEDs must be set high to turn off
    nrf_gpio_pin_set(BLUE_LED); //LEDs must be set high to turn off

