rfloyd01/PersonalCaddie/Firmware/nRF52840_Drivers/main.c
    current_operating_mode = CONNECTED_MODE; //set the current operating mode to idle
}

static void advertising_mode_start()
{
    //There are two ways to get into advertising mode, either by turning the device on,
    //or by losing a connection to a central device (whether this is intentional or 
    //accidental). In the latter case, we need to disable any sensors or peripherals
    //to save on power.

    switch (current_operating_mode)
    {
        case ADVERTISING_MODE:
            return; //no changes need to be made so leave the method
        case SENSOR_ACTIVE_MODE:
            sensor_idle_mode_start();
            //break statement purposely omitted here
        case SENSOR_IDLE_MODE:
            connected_mode_start();
            //break statement purposely omitted here
        default:
            active_led = BLUE_LED;
            nrf_gpio_pin_set(RED_LED); //LEDs must be set high to turn off
            nrf_gpio_pin_set(GREEN_LED); //LEDs must be set high to turn off
            break;
    }

    current_operating_mode = ADVERTISING_MODE; //set the current operating mode to idle
    
    //finally, we need to terminate the existing connection
    //TODO: Implement this feature
}

static void update_sensor_settings_array()
{
    //This method gets called when the sensor settings array is updated in the front end.
    //For the most part all we do here is apply the new settings to the physical array
    //stored in this file, however, depending on the new settings coming in there may be
    //a few other things to change. For example, if a new ODR for a sensor is selected
    //then we'll need to adjust the data reading timer.

    //See if a new sensor was selected for use. If so we need to uninitialize the current
    //sensor and initialize the new one.
    uint8_t new_sensors = 0;

    if (imu_comm.sensor_model[ACC_SENSOR] != sensor_settings[ACC_START + SENSOR_MODEL])
    {
        new_sensors |= 0b001;
        default_sensors[ACC_SENSOR] = sensor_settings[ACC_START + SENSOR_MODEL];
        sensors_initialized[ACC_SENSOR] = false;
    }

    if (imu_comm.sensor_model[GYR_SENSOR] != sensor_settings[GYR_START + SENSOR_MODEL])
    {
        new_sensors |= 0b010;
        default_sensors[GYR_SENSOR] = sensor_settings[GYR_START + SENSOR_MODEL];
        sensors_initialized[GYR_SENSOR] = false;
    }
    
    if (imu_comm.sensor_model[MAG_SENSOR] != sensor_settings[MAG_START + SENSOR_MODEL])
    {
        new_sensors |= 0b100;
        default_sensors[MAG_SENSOR] = sensor_settings[MAG_START + SENSOR_MODEL];
        sensors_initialized[MAG_SENSOR] = false;
    }

    if (new_sensors) sensors_init(false);

    //Check to see if the ODR was updated. If so we update the data reading timer
    //and update the connection interval accordingly.
    float new_sensor_odr = sensor_odr_calculate();
    
    if (new_sensor_odr != current_sensor_odr)
    {
        //NOTE: I no longer change the connection interval to match the current sensor
        //ODR. I'm leaving this code like this though in the event I ever want to 
        //go back.
        //float temp = current_sensor_odr; //save the original odr in case something goes wrong
        //
        //uint32_t err_code = update_connection_interval();
        //if (err_code != NRF_SUCCESS)
        //{
        //    current_sensor_odr = temp; //reset the sensor odr as it wasn't actually updated
        //    SEGGER_RTT_WriteString(0, "Couldn't update connection interval.\n");
        //    error_notification(err_code);
        //}
        //else
        //{
           
        //}
        current_sensor_odr = new_sensor_odr; //update the ODR;

        //If the sensor ODR has changed then we need to check if it would be 
        //more efficient to store more samples in the data characteristic. We
        //also need to update the data acquisition timer to math the ODR.
        update_data_read_timer(1000.0 / current_sensor_odr);
        set_sensor_samples(0); //using 0 here forces the method to use the current connection interval
    }
}

/**@brief Function for handling write events to the Sensor Settings Characteristic.
 *
 * @param[in] p_lbs     Instance of Sensor Settings Service to which the write applies.
 * @param[in] led_state Written/desired state for the sensor settings.
 */
static void sensor_settings_write_handler(uint16_t conn_handle, ble_sensor_service_t * p_ss, const uint8_t* settings_state)
{
    //Different things can happen depending on what gets written to the settings characteristic
    switch (*settings_state)
    {
        case 0:
            advertising_mode_start();
            break;
        case 1:
            connected_mode_start();
            break;
        case 2:
            sensor_idle_mode_start();
            break;
        case 3:
            for (int i = 1; i < SENSOR_SETTINGS_LENGTH; i++) sensor_settings[i] = *(settings_state + i);
            update_sensor_settings_array();
            break;
        case 4:
            sensor_settings[*(settings_state + 1)] = *(settings_state + 2);
            sensor_idle_mode_start();
            break;
        case 5:
            sensor_active_mode_start();
            break;
    }    
}

/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void)
{
    ret_code_t                err_code;
    ble_sensor_service_init_t init  = {0};

    // Initialize sensor service
    init.setting_write_handler = sensor_settings_write_handler;

    err_code = ble_sensor_service_init(&m_ss, &init, SENSOR_SETTINGS_LENGTH);
    APP_ERROR_CHECK(err_code);

    err_code = ble_pc_service_init(&m_pc);
    APP_ERROR_CHECK(err_code);
}


void on_gap_connection_handler()
{
    //This handler method gets called every time a new connection is initiated
    connected_mode_start();
    float new_sensor_odr = sensor_odr_calculate();
    if (new_sensor_odr != current_sensor_odr)
    {
        float temp = current_sensor_odr; //save the original odr in case something goes wrong
        current_sensor_odr = new_sensor_odr;
        uint32_t err_code = update_connection_interval();
        if (err_code != NRF_SUCCESS)
        {
            current_sensor_odr = temp; //reset the sensor odr as it wasn't actually updated
            SEGGER_RTT_WriteString(0, "Couldn't update connection interval.\n");
            error_notification(err_code);
        }
        else
        {
            //If the change was successful we also need to update the data
            //aquisition timer to reflect this new odr
            update_data_read_timer(1000.0 / current_sensor_odr);
        }
    }
}

void on_gap_disconnection_handler()
{
    //This handler method gets called when a connection is lost
    advertising_mode_start();
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}


static void leds_init()
{
    //configure the pins for the BLE 33 Sense on-board red, green and blue tri-colored LED.
    nrf_gpio_cfg_output(RED_LED);
    nrf_gpio_cfg_output(BLUE_LED);
    nrf_gpio_cfg_output(GREEN_LED);
    nrf_gpio_cfg_output(DARK_GREEN_LED);

    //these LEDs are situated backwards from what you would expect so the pin needs to be 
    //pulled high for the LEDs to turn off
    nrf_gpio_pin_set(RED_LED);
    nrf_gpio_pin_set(BLUE_LED);
    nrf_gpio_pin_set(GREEN_LED);

